TestingTool_3-0/src/DataProcessors/УдалениеДанных/УдалениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УдалениеДанных</name>
</mdclass:DataProcessor>

TestingTool_3-0/src/Enums/ВариантыХраненияСобытий/ВариантыХраненияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыХраненияСобытий</name>
  <enumValues>
    <name>Фиксированное</name>
  </enumValues>
  <enumValues>
    <name>ДляУдаления</name>
  </enumValues>
  <enumValues>
    <name>Стандартное</name>
  </enumValues>
</mdclass:Enum>

TestingTool_3-0/src/Catalogs/Проверки/Проверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проверки</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВариантыХраненияСобытий</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/DataProcessors/УдалениеДанных/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПредставлениеРасписанияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Д = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Д.Показать(Новый ОписаниеОповещения("ПредставлениеРасписанияНажатиеЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРасписанияНажатиеЗавершение(Расписание, Доп) Экспорт
	Если Расписание=Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьПараметрыЗаданияСервер(УдалятьУстаревшиеСобытияПоРасписанию, Расписание);
	ОбновитьСостояниеЗаданияСервер();
КонецПроцедуры

&наСервереБезКонтекста
Процедура УстановитьПараметрыЗаданияСервер(Использование, Расписание = Неопределено)
	РЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеУстаревшихСобытий);
	ЗаписатьИзменения = Ложь;
	Если Использование <> РЗ.Использование Тогда
		РЗ.Использование = Использование;
		ЗаписатьИзменения = Истина;
		РЗ.Записать();
	КонецЕсли;
	Если Расписание <> Неопределено Тогда
		РЗ.Расписание = Расписание;
		ЗаписатьИзменения = Истина;
	КонецЕсли;
	Если ЗаписатьИзменения=Истина Тогда
		РЗ.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
	ВыполнитьСейчасНаСервере();
	ОбновитьСостояниеВыполненияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеВыполнения(Команда)
	ОбновитьСостояниеВыполненияСервер();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыполнитьСейчасНаСервере()
	СценарноеТестированиеСервер.УдалениеУстаревшихСобытий();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СрокХраненияСобытий = Константы.СрокХраненияСобытий.Получить();
	ОбновитьСостояниеЗаданияСервер();
	ОбновитьСостояниеВыполненияСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеВыполненияСервер()
	Если СрокХраненияСобытий=0 Тогда
		СостояниеВыполнения = "Удаление отключено";
	Иначе		
		Запрос = Новый Запрос(ТекстЗапросаКоличествоОбъектов());
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("СрокХранениСобытий", СрокХраненияСобытий);
		Результаты = Запрос.ВыполнитьПакет();
		КУдалению0 = Результаты[0].Выгрузить().Итог("Количество");
		КУдалению1 = Результаты[1].Выгрузить().Итог("Количество");
		Если КУдалению0+КУдалению1=0 Тогда
			СостояниеВыполнения = "Нет объектов к удалению";
		Иначе
			СостояниеВыполнения = СтрШаблон("К удалению: %1/%2", КУдалению0, КУдалению1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаКоличествоОбъектов()
	Возврат "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Т.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Проверки КАК Т
	|ГДЕ
	|	Т.ПометкаУдаления
	|	ИЛИ &СрокХранениСобытий <> 0
	|	И РАЗНОСТЬДАТ(Т.ДатаНачала, &ТекущаяДата, День) > &СрокХранениСобытий
	|	ИЛИ Т.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВариантыХраненияСобытий.ДляУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Т.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Сборки КАК Т
	|ГДЕ
	|	Т.ПометкаУдаления
	|	ИЛИ &СрокХранениСобытий <> 0
	|	И РАЗНОСТЬДАТ(Т.ДатаНачала, &ТекущаяДата, День) > &СрокХранениСобытий";
КонецФункции

&НаСервере
Процедура ОбновитьСостояниеЗаданияСервер()
	РЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.УдалениеУстаревшихСобытий);
	УдалятьУстаревшиеСобытияПоРасписанию = РЗ.Использование;
	РасписаниеРегламентногоЗадания = РЗ.Расписание;
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);
КонецПроцедуры

&НаКлиенте
Процедура СрокХраненияСобытийПриИзменении(Элемент)
	УстановитьКонстантуСрокХраненияСобытийСервер(СрокХраненияСобытий);
	ОбновитьСостояниеВыполненияСервер();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьКонстантуСрокХраненияСобытийСервер(СрокХраненияСобытий)
	Константы.СрокХраненияСобытий.Установить(СрокХраненияСобытий);	
КонецПроцедуры

&НаКлиенте
Процедура УдалятьУстаревшиеСобытияПоРасписаниюПриИзменении(Элемент)
	УстановитьПараметрыЗаданияСервер(УдалятьУстаревшиеСобытияПоРасписанию);
	УстановитьОбработчикОжидания();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбработчикОжидания();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбработчикОжидания()
	Если УдалятьУстаревшиеСобытияПоРасписанию Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеВыполненияТаймер", 30);
	Иначе
		ОтключитьОбработчикОжидания("ОбновитьСостояниеВыполненияТаймер");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеВыполненияТаймер() Экспорт
	ОбновитьСостояниеВыполненияСервер();
КонецПроцедуры
